{
  "name": "Guilherme dos Anjos",
  "photo": "https://avatars.githubusercontent.com/u/49658386?s=400&u=f5224918b910962e6eec5c4f5720e6ddf1e4f575&v=4",
  "job": "Desenvolvedor Web Jr",
  "location": "São Paulo - SP",
  "phone": "(11) 90000-0000",
  "email": "guilherme.macedo1598@gmail.com",
  "skills": {
    "hardSkills": [
      {
        "name": "HTML",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/html.png"
      },
      {
        "name": "CSS",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/css.png"
      },
      {
        "name": "JavaScript",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/js.png"
      },
      {
        "name": "NodeJs",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/nodejs.png"
      },
      {
        "name": "React",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/react.png"
      }
    ],
    "softSkills": [
      "Lógica de programação e resolução de problemas.",
      "Liderança",
      "Trabalho em equipe",
      "Flexibilidade",
      "Organização"
    ]
  },
  "languages": [
    "Português BR",
    "Inglês (Básico)"
  ],
  "portfolio": [
    {
      "name": "Projeto - Trilha JS Developer-Portifólio",
      "description": "Como parte da conclusão do curso Formação JavaScript Developer promovido pela DIO, desenvolvi o projeto do Portfólio. Esse projeto consiste em criar uma aplicação web que consome um arquivo JSON com informações relevantes sobre meu currículo e projetos desenvolvidos. A aplicação foi desenvolvida para exibir uma listagem dinâmica dos dados, proporcionando uma experiência interativa aos usuários. Utilizei todo o conhecimento adquirido durante o bootcamp para adicionar novas funcionalidades ao projeto. Uma das principais funcionalidades implementadas foi a inclusão de um botão de download, que permite aos visitantes baixarem meu currículo completo em formato PDF. Além disso, realizei estilizações, transições e adicionei dados complementares para tornar o portfólio mais atrativo visualmente. Ao concluir esse projeto, pude aplicar de forma prática os conceitos aprendidos, como manipulação de dados JSON, integração de funcionalidades avançadas e aprimoramento de aspectos visuais. Essa experiência me proporcionou um maior domínio do JavaScript e sua aplicação na criação de aplicações web interativas e funcionais. O projeto do Portfólio representa um marco importante na minha jornada como desenvolvedor JavaScript e destaca minhas habilidades adquiridas ao longo do bootcamp.",
      "url": "https://guilherme-dev15.github.io/trilha-js-developer-pokedex",
      "github": true
    },
    {
      "name": "Projeto - Trilha JS Developer-Pokedex",
      "description": "Este projeto foi desenvolvido como parte do curso Formação JavaScript Developer promovido pela DIO.\nO projeto da Pokedex consiste em criar uma aplicação web que consome uma API de Pokemons para exibir uma listagem com suas principais informações.\nA aplicação permite que os usuários carreguem mais Pokemons para serem exibidos na listagem.\nComo desafio, utilizei todo o conhecimento adquirido para adicionar novas funcionalidades, como a inclusão de um botão para abrir um modal e visualizar detalhes específicos de cada Pokemon, incluindo suas estatísticas básicas.",
      "url": "https://guilherme-dev15.github.io/trilha-js-developer-pokedex",
      "github": true
    },
    {
      "name": "Projeto - Listagem de Pokémon",
      "description": "Este projeto de listagem de Pokémon foi desenvolvido como parte do evento 'Semana Do Zero Ao Programador Contratado' promovido pela DevEmDobro.\nO objetivo do projeto é criar uma interface responsiva utilizando HTML, CSS e JavaScript, que exiba uma lista de Pokémon e permita a troca de temas entre o modo claro e o modo escuro.",
      "url": "https://guilherme-dev15.github.io/projeto-listagem-pokemon/",
      "github": true
    },
    {
      "name": "Projeto - [Grid e Variaveis]",
      "description": "Durante o projeto, adquiri conhecimentos avançados em CSS, incluindo a utilização de variáveis para definir padrões de cores e tamanhos, o que proporcionou uma maior dinamicidade à página.\nAlém disso, aprendi conceitos de display, como o uso do Grid, permitindo a criação de layouts complexos e totalmente responsivos para diferentes dispositivos.\nEmbora tenha sido desafiador, consegui compreender e implementar esses conceitos com sucesso.\nPara tornar o projeto mais moderno e atraente, também adicionei animações e transições, aumentando a interatividade e fluidez da experiência do usuário.",
      "url": "https://guilherme-dev15.github.io/Projetos-HTML-CSS-JAVASCRIPT/Projeto%2005%20-%20Grid%20e%20Variaveis/",
      "github": true
    },
    {
      "name": "Projeto - [Responsividade ]",
      "description": "Este é o primeiro projeto voltado para o aprimoramento em responsividade.\nDurante o processo, pude entender melhor a diferença entre o uso de px e rem e adotar melhores práticas para o desenvolvimento, como a estratégia Mobile First. Dessa forma, pude compreender como ser mais eficiente no desenvolvimento.",
      "url": "https://guilherme-dev15.github.io/Projetos-HTML-CSS-JAVASCRIPT/Projeto%2004%20-%20Reponsividade/",
      "github": true
    },
    {
      "name": "Desafio do Evento NLW eSports - Trilha Explorer (Rocketseat)",
      "description": "Projeto construído como desafio do evento Next Level Week da Rocketseat",
      "url": "https://guilherme-dev15.github.io/Evento-nlw/Desafio/nlw-esports-explorer/",
      "github": true
    },
    {
      "name": "Evento NLW eSports - Trilha Explorer (Rocketseat)",
      "description": "Projeto construído do evento Next Level Week da Rocketseat",
      "url": "https://guilherme-dev15.github.io/Evento-nlw/nlw-esports-explorer/",
      "github": true
    },
    {
      "name": "Projeto - Formulário - Cadastro de Música",
      "description": "Este projeto é um formulário para cadastrar informações de músicas, onde o usuário deve preencher informações básicas do álbum, dados de acesso e agendar pré-lançamento.\nO formulário conta com validações de campos, como tamanho mínimo de caracteres, formato de e-mail válido e somente números para campo de telefone, e também um script para ocultar um campo quando uma caixa de seleção é marcada.",
      "url": "https://guilherme-dev15.github.io/Projetos-HTML-CSS-JAVASCRIPT/Projeto%2003%20-%20Forulário%20HTML-CSS/",
      "github": true
    },
    {
      "name": "Projeto - [Saúde Total]",
      "description": "Este é o segundo projeto desenvolvido no curso uma landing page simple e moderna.\nO desafio do projeto era organizar os elementos dentro da page e aplicar os posicionamentos.\nAtravés de tudo isso, eu pude entender melhor como usar o HTML e CSS para criar uma interface de usuário atraente e funcional.\nPara deixar mais aprimorada, adicionei animações, transformações e personalizei as imagens e paleta de cores usadas originalmente para da um toque mais pessoal e atraente",
      "url": "https://guilherme-dev15.github.io/Projetos-HTML-CSS-JAVASCRIPT/Projeto%2002%20-%20Saude%20Total%20-%20HTML-CSS/",
      "github": true
    },
    {
      "name": "Projeto - [Cyber Safe]",
      "description": "Durante um curso, tive a oportunidade de desenvolver meu primeiro projeto, uma landing page simples usando HTML e CSS.\nA página apresenta elementos posicionados e alinhados cuidadosamente, combinados com as fontes Inter e Open Sans para criar uma estética moderna.\nO código HTML é estruturado de forma simples, contendo uma imagem, um título e um texto descritivo.\nO CSS é responsável pelo estilo visual da página, incluindo fontes, cores, espaçamentos e posicionamento dos elementos.\nEm suma, esse projeto serviu como uma base inicial para o meu aprendizado em HTML e CSS, permitindo que eu praticasse conceitos básicos dessas linguagens.",
      "url": "https://guilherme-dev15.github.io/Projetos-HTML-CSS-JAVASCRIPT/Projeto%2001%20-%20CyberSafe%20HTML-CSS/",
      "github": true
    }
  ],
  "professionalExperience": [
    {
      "name": "Analista de Suporte Computacional – BRINT COMÉRCIO E INDÚSTRIA DE EQUIPAMENTOS INDUSTRIAIS LTDA",
      "period": "12/2021 - 11/2022",
      "description": "Forneci suporte técnico a usuários para problemas de hardware e software, incluindo configuração e instalação de softwares<br> Realizei manutenção e reparo de equipamentos de TI, incluindo desktops, laptops e impressoras<br> Configurei e gerenciei o Active Directory, incluindo a criação de usuários e atribuição de direitos de acesso<br> Monitorei e gerenciei a rede de computadores, solucionando problemas de conectividade e implementando atualizações de segurança<br> Criei e executei consultas em um banco de dados Oracle<br> Criei e gerenciei views em um banco de dados para simplificar o acesso aos dados"
    },
    {
      "name": "Auxiliar Administrativo - 14º CARTÓRIO DA LAPA REGISTRO CIVIL",
      "period": "09/2019 - 12/2021",
      "description": "Auxiliei nas atividades do cartório, incluindo digitalização de documentos e atendimento ao cliente.<br>Digitei aberturas de firmas, reconhecimento de firmas, autenticações, cópias de documentação e preenchimento de formulários.<br>Prestei suporte interno, configurando impressoras, criando usuários, instalando e configurando certificados digitais.<br>"
    },
    {
      "name": "Estágiario - São Paulo Transportes S/A",
      "period": "06/2017 - 12/2018",
      "description": "Prestei suporte aos usuários em sistemas, aplicativos, redes e zelo pelos recursos de hardware e software.<br>Realizei backup, formatação de equipamentos, instalação de sistemas operacionais e de softwares e montagem de microcomputadores e redes."
    }
  ]
}